test/Microsoft.AspNet.WebHooks.Receivers.Salesforce.Test/Messages/OutboundMessage2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
    </notifications>
  </soapenv:Body>
</soapenv:Envelope>
